cases/fluids/dns-boxturb16/solution/tutorial-ref/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication boxTurb

runApplication $(getApplication)

runApplication postProcess -func enstrophy

#------------------------------------------------------------------------------
